In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
dict={
    "name":['aman','anshu','junu','kripa'],
    "marks":[34,43,5,54]

}

In [4]:
data = pd.DataFrame(dict)

In [5]:
data

    name  marks
0   aman     34
1  anshu     43
2   junu      5
3  kripa     54

In [6]:
data.to_csv("sibblings.cvs",index=1)

In [7]:
data

    name  marks
0   aman     34
1  anshu     43
2   junu      5
3  kripa     54

In [8]:
data.head(3)

    name  marks
0   aman     34
1  anshu     43
2   junu      5

In [9]:
data.tail(2)

    name  marks
2   junu      5
3  kripa     54

In [10]:
data.describe()

           marks
count   4.000000
mean   34.000000
std    20.992062
min     5.000000
25%    26.750000
50%    38.500000
75%    45.750000
max    54.000000

In [11]:
anshu=pd.read_csv('anshu.csv')

In [12]:
anshu

   Unnamed: 0   name  marks
0           0   aman     34
1           1  anshu     43
2           2   junu      5
3           3  kripa     54

In [13]:
anshu['name']

0     aman
1    anshu
2     junu
3    kripa
Name: name, dtype: object

In [14]:
anshu['name'][0]="kripa"

C:\Users\V I C T U S\AppData\Local\Temp\ipykernel_1448\4143820807.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  anshu['name'][0]="kripa"

In [15]:
anshu

   Unnamed: 0   name  marks
0           0  kripa     34
1           1  anshu     43
2           2   junu      5
3           3  kripa     54

In [16]:
anshu.head(2)

   Unnamed: 0   name  marks
0           0  kripa     34
1           1  anshu     43

In [17]:
anshu.to_csv("kripa.csv")

In [18]:
anshu.to_csv("kripa2.csv",index=False)

In [19]:
anshu.index=['a','b','c','d']

In [20]:
anshu

   Unnamed: 0   name  marks
a           0  kripa     34
b           1  anshu     43
c           2   junu      5
d           3  kripa     54

In [21]:
anshu.index[0]

'a'

In [22]:
print(" this is the best ")

 this is the best

In [23]:
d={
    "name":['anshu','kripa','junu','jerry'],
    "age":[22,34,56,7]

    
}

In [24]:
names=pd.DataFrame(d)

In [25]:
names

    name  age
0  anshu   22
1  kripa   34
2   junu   56
3  jerry    7

In [27]:
names.to_csv("names of family.csv")

In [28]:
tim= pd.read_csv("names of family.csv")

In [29]:
tim

   Unnamed: 0   name  age
0           0  anshu   22
1           1  kripa   34
2           2   junu   56
3           3  jerry    7

In [30]:
tim.head(2)

   Unnamed: 0   name  age
0           0  anshu   22
1           1  kripa   34

In [31]:
tim.tail(1)

   Unnamed: 0   name  age
3           3  jerry    7

In [32]:
tim.describe()

       Unnamed: 0        age
count    4.000000   4.000000
mean     1.500000  29.750000
std      1.290994  20.694202
min      0.000000   7.000000
25%      0.750000  18.250000
50%      1.500000  28.000000
75%      2.250000  39.500000
max      3.000000  56.000000

In [33]:
tim.index[1]

1

In [34]:
tim.[age]

SyntaxError: invalid syntax (2019534647.py, line 1)

In [35]:
tim['age']

0    22
1    34
2    56
3     7
Name: age, dtype: int64

In [40]:
tim['name']

0    anshu
1    kripa
2     junu
3    jerry
Name: name, dtype: object

In [41]:
print(tim)

   Unnamed: 0   name  age
0           0  anshu   22
1           1  kripa   34
2           2   junu   56
3           3  jerry    7